//შექმენით “Store” კლასი, რომელიც ინახავს შემდეგ ინფორმაციას:
// მაღაზიის სახელი
// მაღაზიის მისამართი
// მაღაზიის ტიპი:
//o სასურსათო მაღაზია
//o ტექნიკის მაღაზია
//o ტანისამოსის მაღაზია
//o ფეხსაცმლის მაღაზია
//შეიმუშავეთ კლასის ფუნქციონირებისთვის საჭირო მეთოდები და Properties (თვისებები).
//კლასმა უნდა განახორციელოს IDisposable ინტერფეისი. კლასის ფუნქციონალის დასატესტად შეიმუშავეთ
//კოდი.
//დაწერეთ კოდი Dispose-ის გამოსაძახებლად. 

using C__Anonymous_Functions.Models;

using (Store store = new Store("Nikora", "Tbilisi", StoreType.Grocery))
{
    store.ShowInfo();
}
